app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["first_name", "Muhammad"], ["last_name", "Saleem"], ["email", "ali@devsinc.com"], ["created_at", "2022-04-18 10:57:06.017949"], ["updated_at", "2022-04-18 10:57:06.017949"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "first_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["first_name", "ali"], ["updated_at", "2022-04-15 10:10:20.309399"], ["id", 6]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)